Revit 2027 API
NumberingSchema.GetCategoriesWitheBuiltInMatching Method
 Returns a set of all the categories ids that support built-in matching.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ISet<ElementId> GetCategoriesWitheBuiltInMatching()
Public Shared Function GetCategoriesWitheBuiltInMatching As ISet(Of ElementId)
public:
static ISet<ElementId^>^ GetCategoriesWitheBuiltInMatching()
static member GetCategoriesWitheBuiltInMatching : unit -> ISet<ElementId>
Return Value
ISet<ElementId>
See Also
Reference
NumberingSchema Class
Autodesk.Revit.DB Namespace